SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_eusart.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 EUSART register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_EUSART_H
#define EFR32SG23_EUSART_H

#define EUSART_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_EUSART EUSART
 * @{
 * @brief EFR32SG23 EUSART Register Declaration.
 *****************************************************************************/

/** EUSART Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP version ID                                      */
  __IOM uint32_t             EN;                     /**< Enable Register                                    */
  __IOM uint32_t             CFG0;                   /**< Configuration 0 Register                           */
  __IOM uint32_t             CFG1;                   /**< Configuration 1 Register                           */
  __IOM uint32_t             CFG2;                   /**< Configuration 2 Register                           */
  __IOM uint32_t             FRAMECFG;               /**< Frame Format Register                              */
  __IOM uint32_t             DTXDATCFG;              /**< Default TX DATA Register                           */
  __IOM uint32_t             IRHFCFG;                /**< HF IrDA Mod Config Register                        */
  __IOM uint32_t             IRLFCFG;                /**< LF IrDA Pulse Config Register                      */
  __IOM uint32_t             TIMINGCFG;              /**< Timing Register                                    */
  __IOM uint32_t             STARTFRAMECFG;          /**< Start Frame Register                               */
  __IOM uint32_t             SIGFRAMECFG;            /**< Signal Frame Register                              */
  __IOM uint32_t             CLKDIV;                 /**< Clock Divider Register                             */
  __IOM uint32_t             TRIGCTRL;               /**< Trigger Control Register                           */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IM  uint32_t             RXDATA;                 /**< RX Data Register                                   */
  __IM  uint32_t             RXDATAP;                /**< RX Data Peek Register                              */
  __IOM uint32_t             TXDATA;                 /**< TX Data Register                                   */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY;               /**< Synchronization Busy Register                      */
        uint32_t             RESERVED0[42U];    /**< Reserved for future use                            */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED2[959U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP version ID                                      */
  __IOM uint32_t             EN_SET;                 /**< Enable Register                                    */
  __IOM uint32_t             CFG0_SET;               /**< Configuration 0 Register                           */
  __IOM uint32_t             CFG1_SET;               /**< Configuration 1 Register                           */
  __IOM uint32_t             CFG2_SET;               /**< Configuration 2 Register                           */
  __IOM uint32_t             FRAMECFG_SET;           /**< Frame Format Register                              */
  __IOM uint32_t             DTXDATCFG_SET;          /**< Default TX DATA Register                           */
  __IOM uint32_t             IRHFCFG_SET;            /**< HF IrDA Mod Config Register                        */
  __IOM uint32_t             IRLFCFG_SET;            /**< LF IrDA Pulse Config Register                      */
  __IOM uint32_t             TIMINGCFG_SET;          /**< Timing Register                                    */
  __IOM uint32_t             STARTFRAMECFG_SET;      /**< Start Frame Register                               */
  __IOM uint32_t             SIGFRAMECFG_SET;        /**< Signal Frame Register                              */
  __IOM uint32_t             CLKDIV_SET;             /**< Clock Divider Register                             */
  __IOM uint32_t             TRIGCTRL_SET;           /**< Trigger Control Register                           */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IM  uint32_t             RXDATA_SET;             /**< RX Data Register                                   */
  __IM  uint32_t             RXDATAP_SET;            /**< RX Data Peek Register                              */
  __IOM uint32_t             TXDATA_SET;             /**< TX Data Register                                   */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY_SET;           /**< Synchronization Busy Register                      */
        uint32_t             RESERVED3[42U];    /**< Reserved for future use                            */
        uint32_t             RESERVED4[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED5[959U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP version ID                                      */
  __IOM uint32_t             EN_CLR;                 /**< Enable Register                                    */
  __IOM uint32_t             CFG0_CLR;               /**< Configuration 0 Register                           */
  __IOM uint32_t             CFG1_CLR;               /**< Configuration 1 Register                           */
  __IOM uint32_t             CFG2_CLR;               /**< Configuration 2 Register                           */
  __IOM uint32_t             FRAMECFG_CLR;           /**< Frame Format Register                              */
  __IOM uint32_t             DTXDATCFG_CLR;          /**< Default TX DATA Register                           */
  __IOM uint32_t             IRHFCFG_CLR;            /**< HF IrDA Mod Config Register                        */
  __IOM uint32_t             IRLFCFG_CLR;            /**< LF IrDA Pulse Config Register                      */
  __IOM uint32_t             TIMINGCFG_CLR;          /**< Timing Register                                    */
  __IOM uint32_t             STARTFRAMECFG_CLR;      /**< Start Frame Register                               */
  __IOM uint32_t             SIGFRAMECFG_CLR;        /**< Signal Frame Register                              */
  __IOM uint32_t             CLKDIV_CLR;             /**< Clock Divider Register                             */
  __IOM uint32_t             TRIGCTRL_CLR;           /**< Trigger Control Register                           */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IM  uint32_t             RXDATA_CLR;             /**< RX Data Register                                   */
  __IM  uint32_t             RXDATAP_CLR;            /**< RX Data Peek Register                              */
  __IOM uint32_t             TXDATA_CLR;             /**< TX Data Register                                   */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY_CLR;           /**< Synchronization Busy Register                      */
        uint32_t             RESERVED6[42U];    /**< Reserved for future use                            */
        uint32_t             RESERVED7[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED8[959U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP version ID                                      */
  __IOM uint32_t             EN_TGL;                 /**< Enable Register                                    */
  __IOM uint32_t             CFG0_TGL;               /**< Configuration 0 Register                           */
  __IOM uint32_t             CFG1_TGL;               /**< Configuration 1 Register                           */
  __IOM uint32_t             CFG2_TGL;               /**< Configuration 2 Register                           */
  __IOM uint32_t             FRAMECFG_TGL;           /**< Frame Format Register                              */
  __IOM uint32_t             DTXDATCFG_TGL;          /**< Default TX DATA Register                           */
  __IOM uint32_t             IRHFCFG_TGL;            /**< HF IrDA Mod Config Register                        */
  __IOM uint32_t             IRLFCFG_TGL;            /**< LF IrDA Pulse Config Register                      */
  __IOM uint32_t             TIMINGCFG_TGL;          /**< Timing Register                                    */
  __IOM uint32_t             STARTFRAMECFG_TGL;      /**< Start Frame Register                               */
  __IOM uint32_t             SIGFRAMECFG_TGL;        /**< Signal Frame Register                              */
  __IOM uint32_t             CLKDIV_TGL;             /**< Clock Divider Register                             */
  __IOM uint32_t             TRIGCTRL_TGL;           /**< Trigger Control Register                           */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IM  uint32_t             RXDATA_TGL;             /**< RX Data Register                                   */
  __IM  uint32_t             RXDATAP_TGL;            /**< RX Data Peek Register                              */
  __IOM uint32_t             TXDATA_TGL;             /**< TX Data Register                                   */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY_TGL;           /**< Synchronization Busy Register                      */
        uint32_t             RESERVED9[42U];    /**< Reserved for future use                            */
        uint32_t             RESERVED10[1U];         /**< Reserved for future use                            */
} EUSART_TypeDef;
/** @} End of group EFR32SG23_EUSART */

/**************************************************************************//**
 * @addtogroup EFR32SG23_EUSART
 * @{
 * @defgroup EFR32SG23_EUSART_BitFields EUSART Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for EUSART IPVERSION */
#define _EUSART_IPVERSION_RESETVALUE            0x00000001UL                            /**< Default value for EUSART_IPVERSION          */
#define _EUSART_IPVERSION_MASK                  0xFFFFFFFFUL                            /**< Mask for EUSART_IPVERSION                   */
#define _EUSART_IPVERSION_IPVERSION_SHIFT       0                                       /**< Shift value for EUSART_IPVERSION            */
#define _EUSART_IPVERSION_IPVERSION_MASK        0xFFFFFFFFUL                            /**< Bit mask for EUSART_IPVERSION               */
#define _EUSART_IPVERSION_IPVERSION_DEFAULT     0x00000001UL                            /**< Mode DEFAULT for EUSART_IPVERSION           */
#define EUSART_IPVERSION_IPVERSION_DEFAULT      (_EUSART_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_IPVERSION   */

/* Bit fields for EUSART EN */
#define _EUSART_EN_RESETVALUE                   0x00000000UL                            /**< Default value for EUSART_EN                 */
#define _EUSART_EN_MASK                         0x00000003UL                            /**< Mask for EUSART_EN                          */
#define EUSART_EN_EN                            (0x1UL << 0)                            /**< Module enable                               */
#define _EUSART_EN_EN_SHIFT                     0                                       /**< Shift value for EUSART_EN                   */
#define _EUSART_EN_EN_MASK                      0x1UL                                   /**< Bit mask for EUSART_EN                      */
#define _EUSART_EN_EN_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for EUSART_EN                  */
#define EUSART_EN_EN_DEFAULT                    (_EUSART_EN_EN_DEFAULT << 0)            /**< Shifted mode DEFAULT for EUSART_EN          */
#define EUSART_EN_DISABLING                     (0x1UL << 1)                            /**< Disablement busy status                     */
#define _EUSART_EN_DISABLING_SHIFT              1                                       /**< Shift value for EUSART_DISABLING            */
#define _EUSART_EN_DISABLING_MASK               0x2UL                                   /**< Bit mask for EUSART_DISABLING               */
#define _EUSART_EN_DISABLING_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EUSART_EN                  */
#define EUSART_EN_DISABLING_DEFAULT             (_EUSART_EN_DISABLING_DEFAULT << 1)     /**< Shifted mode DEFAULT for EUSART_EN          */

